{
  "Adventure": "Write as if this story will be professionally published in a children's storybook. Use vivid, action-packed scenes, specific sensory details, and immersive settings. Avoid vague phrases—every peril should feel real.\n\nThe example below is just a tone guide—do not reuse characters or phrases, but echo the rhythm and excitement:\n\n\"Marisol’s hand hovered over the giant ivory die, and the moment she let it roll, the undergrowth groaned. From the vines overhead came a low roar, and in that heartbeat before the world shook, she knew the game had begun.\"\n\nNow write a 500–550-word adventure story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Adventure\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but invent **new** jungle-peril surprises:\n• • Every choice triggers a fresh hazard (river rapids, stampeding creatures, collapsing ruins)\n• • The environment feels alive and unpredictable\n• • A climactic twist that turns the quest on its head",

  "Bedtime": "Write as if this story will be professionally published in a children's bedtime collection. Use soft, poetic language with gentle repetition, cozy sensory details, and a calming rhythm. Avoid high-stakes drama.\n\nThe example below is just a tone guide—do not reuse the lines, but echo the dreamlike pace:\n\n\"Moonlight tiptoed across the quilted meadow, where fireflies hummed lullabies and sleepy blossoms curled up under starlight.\"\n\nNow write a 500–550-word bedtime story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Bedtime\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but create **new** dreamy imagery:\n• • Gentle, repeating phrases that soothe\n• • Soft sounds and slow pacing\n• • A warm, peaceful resolution that eases toward sleep",

  "Comedy": "Write as if this story will be professionally published for kids who love to laugh. Use a zany, energetic tone, clever character quirks, and snappy pacing. Dialogue and narration should sparkle with personality.\n\nThe example below is just a tone guide—do not reuse the jokes or characters, but echo the silliness:\n\n\"The chicken waltzed into the classroom wearing a neon tutu and a top hat, squawking punchlines that sounded suspiciously like giggling kazoo solos.\"\n\nNow write a 500–550-word comedy story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Comedy\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but invent **fresh** absurd scenarios:\n• • Wild, visual humor and surprising props\n• • A narrator or character with a distinct, funny voice\n• • A punchline or reversal twist that ties the chaos together",

  "Fairy Tale": "Write as if this story will be professionally published in a modern fairy tale anthology. Use lyrical language, enchanted imagery, and a warm, classic tone with original twists. Avoid copying old tropes—make it feel fresh but timeless.\n\nThe example below is just a tone guide—do not reuse these characters or settings, but echo the charm and rhythm:\n\n\"Once upon a time, a silver fox in a velvet waistcoat tiptoed through meadows of peppermint flowers, humming a tune of moonlit secrets.\"\n\nNow write a 500–550-word fairy tale for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Fairy Tale\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but conjure **new** magical settings:\n• • Talking animals, enchanted forests, or peculiar rules\n• • Soft rhyme or poetic phrasing (without forcing it)\n• • A heartfelt moral or transformation by the end",

  "Fantasy": "Write as if this story will be professionally published in a children's fantasy storybook. Use vivid details, specific character actions, and immersive magical settings. Let the narrator have a curious, witty, or slightly ironic voice depending on the moment.\n\nThe example below is just a tone guide—do not reuse phrases or characters, but echo the rhythm and literary texture:\n\n\"Ani knew she shouldn’t chase butterflies into the woods—especially not ones that glowed and whispered—but her curiosity had always been louder than her good sense. The trees folded in behind her like a secret, and ahead lay a castle that definitely hadn’t been there yesterday.\"\n\nNow write a 500–550-word fantasy story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Fantasy\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but invent **new** magical twists:\n• • The narrator is observant and occasionally dry-witted\n• • Magical elements are strange, specific, and treated as almost ordinary\n• • Hint at a larger world beyond the story (odd customs, curious rules)\n• • One clever twist or strange turn near the end",

  "Mystery": "Write as if this mystery will be published in a storybook that balances suspense with dry humor. Use short, clever sentences and a narrator who occasionally breaks the fourth wall. Let the clues feel real and surprising, not random.\n\nThe example below is just a tone guide—do not reuse the setup, but echo the wit and misdirection:\n\n\"You may believe mysteries are thrilling, but Mr. Quill would warn you otherwise—especially when the culprit is your own reflection.\"\n\nNow write a 500–550-word mystery story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Mystery\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but create **new** puzzling clues:\n• • Direct reader asides (“You might think...”) with wry humor\n• • A trail of strange but logical events\n• • A twist that satisfies and actually explains what happened",

  "Outer Space": "Write as if this interstellar tale will be published in a storybook full of cosmic wonder. Let the setting dazzle with color and imagination, and make the characters feel joyful, curious, and clever. Keep the tone playful but grounded in emotion.\n\nThe example below is just a tone guide—do not reuse this scene, but echo the sense of wonder:\n\n\"The starship zoomed past sparkling nebulas as Captain Nova waved frantically at her new alien best friend, Zorg the planet-hopper.\"\n\nNow write a 500–550-word outer-space story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Outer Space\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but invent **new** cosmic scenes:\n• • Unique alien names, planetary features, or space gadgets\n• • Silly tech mishaps or clever problem-solving\n• • A meaningful twist (a friendship, discovery, or surprise about the universe)",

  "Science Fiction": "Write as if this story will be published in a clever, tech-themed kids' anthology. Use inventive gadgets, quirky narration, and a mix of techno-wit and emotional warmth. Avoid generic tech—make every invention memorable.\n\nThe example below is just a tone guide—do not reuse the robot or marshmallows, but echo the wild inventor energy:\n\n\"Dr. Quibble's gadget sputtered to life, and the robot quipped, 'Behold—another brilliant invention destined to accidentally flood the lab in marshmallows.'\"\n\nNow write a 500–550-word science fiction story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Science Fiction\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but create **new** tech chaos:\n• • Memorable devices or inventions-gone-wrong\n• • A snarky robot, scientist, or narrator with strong voice\n• • A smart, funny twist grounded in character choice",

  "Spooky": "Write as if this story will be published in a spooky-but-silly children's collection. Let the mood be eerie yet playful, with vivid gothic details and a narrator who occasionally makes dry or curious remarks.\n\nThe example below is just a tone guide—do not reuse the imagery, but echo the haunting whimsy:\n\n\"Through the knotted trees appeared a ghostly woman in tattered robes, a lantern full of lightning bugs swinging at her hip, and a scarf woven from whispering spider silk. She glided forward, tipping her hat—if hats could tip—and whispered, 'Just don’t feed it after midnight.' Then she vanished.\"\n\nNow write a 500–550-word spooky-but-fun story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Spooky\n- {Include this detail: {custom_detail}}\n\nMatch the tone above, but invent **new** spooky twists:\n• • Vivid, eerie imagery with playful or absurd details\n• • A narrator who occasionally breaks the fourth wall\n• • A weird ending that leaves behind something uncanny (a whispering scarf, a glowing bug, a cursed glove)"
}