{
  "Adventure": "Write in a fast-paced, daring voice, like Jumanji mixed with Indiana Jones for kids. Jumanji-style, jungle-peril voice:\n\n“Marisol's hand hovered over the giant ivory die, and the moment she let it roll, the undergrowth groaned. From the vines overhead came a low roar, and in that heartbeat before the world shook, she knew the game had begun.”\n\nNow write a 500-550-word adventure story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Adventure\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Every choice triggers jungle surprises (animals, storms, traps)\n• A sense that the environment itself is alive and testing the hero\n• A heart-pounding twist that turns the game itself into the real challenge",
  "Bedtime": "Write in a soft, soothing voice like Margaret Wise Brown meets Kate DiCamillo. Dream-like, nighttime meadow voice:\n\n“Moonlight tiptoed across the quilted meadow, where fireflies hummed lullabies and sleepy blossoms curled up under starlight.”\n\nNow write a 500-550-word bedtime story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Bedtime\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Gentle imagery and comforting repetition\n• Warm, reassuring narration that eases worries\n• A cozy resolution that lulls into peaceful sleep",
  "Comedy": "Write in a chaotic, playful voice, like Roald Dahl meets Dav Pilkey. Over-the-top, cartoonish humor voice:\n\n“The chicken waltzed into the classroom wearing a neon tutu and a top hat, squawking punchlines that sounded suspiciously like giggling kazoo solos.”\n\nNow write a 500-550-word comedy story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Comedy\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Zany, outrageous scenarios and slapstick surprises\n• Silly wordplay, absurd characters, and playful repetition\n• A final gag twist that leaves everyone giggling",
  "Fairy Tale": "Write in a whimsical, old-timey voice, like Julia Donaldson meets a friendly storyteller. Enchanted forest voice:\n\n“Once upon a time, a silver fox in a velvet waistcoat tiptoed through meadows of peppermint flowers, humming a tune of moonlit secrets.”\n\nNow write a 500-550-word fairy-tale story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Fairy Tale\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Gentle rhyme or rhythmic hints and lyrical imagery\n• Enchanting magical creatures and places\n• A heartfelt moral or warm, satisfying ending",
  "Fantasy": "Write in a curious, mischievous voice, like early J.K. Rowling meets Lewis Carroll. Playful magic-discovery voice:\n\n“Evelyn tapped her wand twice and out popped a turquoise rabbit wearing spectacles, who tipped its hat and declared, 'Tea time—with a side of mischief!’”\n\nNow write a 500-550-word fantasy story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Fantasy\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Strange-but-wonderful magical details and witty narration\n• Quirky characters with unexpected abilities\n• A twist that playfully bends reality",
  "Mystery": "Write in a dry, ironic voice like Lemony Snicket. Wit-laden, cautionary detective voice:\n\n“You may believe mysteries are thrilling, but Mr. Quill would warn you otherwise—especially when the culprit is your own reflection.”\n\nNow write a 500-550-word mystery story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Mystery\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Direct asides to the reader (“You might think…”) with tongue-in-cheek humor\n• Short, punchy sentences sprinkled with one rare big word\n• A clever twist that actually solves the case",
  "Outer Space": "Write in a giddy, wonder-filled voice, like a space-obsessed kid telling you about their alien best friend. Cosmic adventure voice:\n\n“The starship zoomed past sparkling nebulas as Captain Nova waved frantically at her new alien best friend, Zorg the planet-hopper.”\n\nNow write a 500-550-word outer-space story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Outer Space\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Exuberant descriptions of cosmic sights and playful alien names\n• Child-like awe and humor at interstellar oddities\n• A fun gadget or cosmic twist at the end",
  "Science Fiction": "Write in a zany, techno-humor voice, like a madcap inventor crossed with a sarcastic robot. Lab-gone-wild voice:\n\n“Dr. Quibble's gadget sputtered to life, and the robot quipped, 'Behold—another brilliant invention destined to accidentally flood the lab in marshmallows.’”\n\nNow write a 500-550-word science-fiction story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Science Fiction\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Whimsical tech jargon and inventive mishaps\n• Wry robot asides and playful banter\n• A hilarious invention-gone-awry twist",
  "Spooky": "Write in a darkly playful voice, like Edward Gorey. Gothic-playful, slightly unhelpful narrator voice:\n\n“The old manor sat on crooked stilts, its windows grinning in candlelight as if it had a thousand mischievous secrets.”\n\nNow write a 500-550-word spooky-but-silly story for a child aged {age_range}.\n- Main character: {character_name}\n- Theme: Spooky\n- {Include this detail: {custom_detail}}\nMatch the tone above:\n• Dramatic, gothic imagery with a fun twist\n• A narrator who winks at the reader and withholds just enough help\n• An ironic or unresolved twist that's eerie yet playful"
}